export const webeffect: any = [
    {
        "id":0,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Ничего не делать"
    },
    {
        "id":1,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран с плитками"
    },
    {
        "id":2,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран с фильтрами"
    },
    {
        "id":3,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран с параметрами"
    },{
        "id":4,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран с задачами"
    },
    {
        "id":5,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран типа =/= (таблица-таблица снизу)"
    },
    {
        "id":6,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран типа =|о (дерево-мемо справа)"
    },
    {
        "id":7,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран типа =/… (таблица-поля снизу)"
    },
    {
        "id":8,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран типа =/о (таблица-мемо снизу)"
    },
    {
        "id":9,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в другое приложение"
    },
    {
        "id":10,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход на статичную страницу"
    },
    {
        "id":11,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Заполнение Excel-книги данными из БД"
    },
    {
        "id":12,
        "d_start":"1901-01-01",
        "d_fin":"2018-09-07",
        "name":"Заполнение Excel-книги данными с экрана"
    },
    {
        "id":13,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Вызов функции БД без возвращаемого результата"
    },
    {
        "id":14,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Вызов скрипта ОС без возвращаемого результата"
    },
    {
        "id":15,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Открытие модальной формы ввода данных"
    },
    {
        "id":16,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Вызов функции БД, возвращающей одно значение"
    },
    {
        "id":17,
        "d_start":"1901-01-01",
        "d_fin":"2018-09-07",
        "name":"Очистка полей"
    },
    {
        "id":18,
        "d_start":"1901-01-01",
        "d_fin":"2018-09-07",
        "name":"Отмена действия"
    },
    {
        "id":19,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход из Е-меню на страницу заданного cms_id"
    },
    {
        "id":20,
        "d_start":"1901-01-01",
        "d_fin":"2018-10-03",
        "name":"Вызов функции БД, возвращающей одну строку"
    },
    {
        "id":21,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран типа =|... (дерево-поля)"
    },
    {
        "id":22,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран поиска документа"
    },
    {
        "id":23,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Вызов функции веб-сервиса"
    },
    {
        "id":24,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Прорисовка фрэйма с ячейками в экране Древо-поля"
    },
    {
        "id":25,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Вызов javaScript-функции сайта"
    },
    {
        "id":26,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Вызов функции веб-сервиса с передачей ЭП"
    },
    {
        "id":27,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Переход в Экран с документам, заранее заданного типа"
    },
    {
        "id":28,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Открытие диалогового окна выбора файла для его последующей обработки"
    }
];
export const weblook: any = [
    {
        "id":1,
        "d_start":"1901-01-01",
        "d_fin":"2018-09-07",
        "name":"Гиперссылка"
    },
    {
        "id":2,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Кнопка-плитка"
    },
    {
        "id":3,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Кнопка с иконкой"
    },
    {
        "id":4,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Элемент Е-меню"
    },
    {
        "id":5,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Элемент Ж-меню"
    },
    {
        "id":6,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Разделитель экрана"
    },
    {
        "id":7,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Таблица"
    },
    {
        "id":8,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Контейнер с фильтрами"
    },
    {
        "id":9,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Контейнер с полями"
    },
    {
        "id":10,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Заголовок"
    },
    {
        "id":11,
        "d_start":"1901-01-01",
        "d_fin":"2018-10-26",
        "name":"Контейнер с параметрами"
    },
    {
        "id":12,
        "d_start":"1901-01-01",
        "d_fin":"2018-10-26",
        "name":"Контейнер с задачами"
    },
    {
        "id":13,
        "d_start":"1901-01-01",
        "d_fin":"2018-09-07",
        "name":"Кнопка с иконкой внутри колонки таблицы"
    },
    {
        "id":14,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Мемо"
    },
    {
        "id":15,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Мэйл-информеры"
    },
    {
        "id":16,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Дерево"
    },
    {
        "id":17,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Контейнер с ячейками"
    },
    {
        "id":18,
        "d_start":"1901-01-01",
        "d_fin":"3001-01-01",
        "name":"Контейнер с поисковыми полями"
    }
];

